[
  {
    "School Code": "E0000000544",
    "Continent": "Asia",
    "School": "Korea University",
    "Semester details": "tbc",
    "NUS_Module_Code": "ACC1002X, ACC1701X, BSP1005, BSP1703, BSP2001, BSP2701, BSP3001, BSP3701, BSP4513, DAO2703, DOS3701, DOS3702, DOS3703, DOS3811, DSC2006, DSC3201, DSC3202, DSC3203, DSC3211, DSC3219, DSC3222, DSC3222X, FIN2004, FIN2704, FIN2704X, FIN3101, FIN3101A, FIN3102, FIN3103, FIN3113, FIN3115, FIN3116, FIN3117, FIN3119, FIN3120, FIN3120X, FIN3120Y, FIN3120Z, FIN3131, FIN3701, FIN3702, FIN3703, FIN3711, FIN3712, FIN3713, FIN3715, FIN3717, FIN3761X, FIN3761Y, FIN3761Z, FIN4112C, MKT1003, MKT1705, MKT1705X, MKT2401, MKT2412, MKT2413, MKT3402, MKT3412, MKT3413, MKT3416, MKT3418, MKT3420, MKT3422X, MKT3422Y, MKT3422Z, MKT3513, MKT3701, MKT3702, MKT3711, MKT3712, MKT3717, MKT3718, MNO1001, MNO1706, MNO1706X, MNO2007, MNO2009, MNO2302, MNO3301, MNO3303, MNO3313, MNO3313X, MNO3313Y, MNO3313Z, MNO3322",
    "School site": "https://biz.korea.ac.kr/eng/main/main.html",
    "School Review?": "yes"
  },
  {
    "School Code": "E0000001386",
    "Continent": "USA",
    "School": "University of Michigan",
    "Semester details": "tbc",
    "NUS_Module_Code": "FIN4717, FIN3761X, FIN3761Y, FIN3761Z, BSP3701, FIN3701, DBA4811, DBA4761, FIN3712, FIN3702, MKT3702, MKT3718, MKT3714, BSP2701, MNO3761X, DOS3761Y, DOS3761X, MKT3761X",
    "School site": "https://michiganross.umich.edu/",
    "School Review?": "yes"
  },
  {
    "School Code": "E0000001345",
    "Continent": "USA",
    "School": "University of Texas, Austin",
    "Semester details": "tbc",
    "NUS_Module_Code": "MNO2007, MKT3416, FIN3120X, MKT3402, FIN3101, FIN3102, MNO3301, DSC2006, FIN3103, BSP2001, BSP3001, MKT3417, FIN3115, FIN3120Y, FIN3120Z, MKT3420, FIN3118, MKT3422X, MKT3422Z, ACC2002, DSC3201, MKT2412, MKT3422Y, MNO2302, MKT1003, MKT2413, DSC3222, FIN3120, MKT3418, DSC3222X, FIN3113, DSC3222Y, MNO2009, DSC3219, MKT2411, DAO2703, MKT1705, MKT1705X, BSP3701, FIN3701, FIN3702, FIN3703, FIN4717, FIN3711, FIN3714, MKT3702, DOS3701, DSC3225",
    "School site": "https://www.mccombs.utexas.edu/",
    "School Review?": "yes"
  },
  {
    "School Code": "E0000001061",
    "Continent": "Europe",
    "School": "Aarhus School of Business - Denmark",
    "Semester details": "tbc",
    "NUS_Module_Code": "MKT3761Z, MNO3761X, MKT3715, FIN3761X, MKT3701, MNO3761Z, FIN3761Z, MNO3701, DOS3761Z, MKT3721, MKT3714, MNO3761Y, MKT3711, MKT3717, MKT3761X, MKT3812, MKT3718, FIN3761Y, MKT3761Y, DOS3761X, FIN3703, DAO2703, ACC1701X, FIN2704, FIN2704X, FIN3701, FIN3702, FIN3711, MKT3702, BSP3701",
    "School site": "https://bss.au.dk/",
    "School Review?": "yes"
  },
  {
    "School Code": "E0000001063",
    "Continent": "Europe",
    "School": "Copenhagen Business School - Denmark",
    "Semester details": "tbc",
    "NUS_Module_Code": "FIN3115, MNO3313, DSC2006, BSP3001, MNO2007, FIN3120, BSP4511, MNO3313Z, MNO3313Y, MNO3301, FIN3102, MKT2412, MNO3314, DSC3201, FIN3120X, DSC3203, FIN3118, ACC1002X, FIN3120Y, MNO2302, MNO4313, FIN3101, MKT3415, FIN3120Z, FIN4111, MKT3412, FIN3103, FIN2004, MNO3322, FIN4112, BSP4512, BSP2001, MNO3312, MNO3313X, MKT3422Z, MKT1003, MKT3422Y, MNO4313E, FIN3116, MNO4312, MKT4415C, DSC4211X, MKT3422X, MNO2009, MKT4412, MKT2411, FIN3130, MKT3402, MNO3303, DSC3222, DSC3222Y, MNO3330, DSC3222X, DOS3761X, DOS3761Y, DOS3761Z, FIN3761X, FIN3761Y, FIN3761Z, BSP3701, BSP2701, MNO3761X, MNO3761Y, MNO3761Z, FIN3701, FIN3714, FIN3702, MKT3720, ACC1701X, DAO2703, FIN2704, FIN2704X, MKT1705, MKT1705X, DSC3202, DOS3702, FIN3703, FIN3711, FIN3712, FIN3713, MKT3702, DOS3701, DOS3703, DSC3222Z, FIN3117",
    "School site": "https://www.cbs.dk/en",
    "School Review?": "yes"
  },
  {
    "School Code": "E0000001361",
    "Continent": "USA",
    "School": "University of Southern California",
    "Semester details": "tbc",
    "NUS_Module_Code": "BSP2001, BSP2701, BSP3001, BSP3701, DAO2703, DOS3701, DSC2006, DSC3201, DSC3222, DSC4213, FIN2004, FIN2704, FIN2704X, FIN3101, FIN3102, FIN3113, FIN3115, FIN3116, FIN3117, FIN3120, FIN3120X, FIN3120Y, FIN3120Z, FIN3701, FIN3702, FIN3711, FIN3712, FIN3713, FIN3717, FIN3761X, FIN3761Y, FIN3761Z, MKT1003, MKT1705, MKT1705X, MKT2411, MKT2412, MKT2413, MKT3402, MKT3420, MKT3422X, MKT3702, MKT3717, MNO2007, MNO2009, MNO2302, MNO3303, MNO3313, MNO3313F, MNO3313Y, MNO3322",
    "School site": "https://www.marshall.usc.edu/",
    "School Review?": "yes"
  },
  {
    "School Code": "E0000000620",
    "Continent": "Australia",
    "School": "University of Sydney - Australia",
    "Semester details": "tbc",
    "NUS_Module_Code": "BSP2001, BSP2701, BSP3001, BSP3701, DAO2703, DBA3701, DBA3803, DOS3713, DSC3222, FIN2004, FIN2704, FIN2704X, FIN3101, FIN3102, FIN3113, FIN3115, FIN3117, FIN3118, FIN3120, FIN3131, FIN3701, FIN3702, FIN3711, FIN3713, FIN3714, MKT1003, MKT1003A, MKT1003X, MKT1705, MKT1705X, MKT2413, MKT3402, MKT3418, MKT3702, MNO2009, MNO2302, MNO3301, MNO3313, MNO3313F, MNO3313Y, MNO3322, MNO3330",
    "School site": "https://www.sydney.edu.au/business/",
    "School Review?": "yes"
  },
  {
    "School Code": "E0000000628",
    "Continent": "Australia",
    "School": "Monash University",
    "Semester details": "tbc",
    "NUS_Module_Code": "BSP1004, BSP2001, BSP2701, BSP3001, BSP3701, DAO2703, DSC2006, FIN2004, FIN2704, FIN2704X, FIN3101, FIN3103, FIN3701, FIN3703, MKT1003, MKT1705, MKT1705X, MKT3402, MKT3702, MNO1001, MNO1706, MNO1706X, MNO2007, MNO3301\n\n",
    "School site": "https://www.monash.edu/business",
    "School Review?": "yes"
  },
  {
    "School Code": "E0000000687",
    "Continent": "Canada",
    "School": "Queen's University",
    "Semester details": "tbc",
    "NUS_Module_Code": "ACC1002X, ACC1701, ACC1701X, BSP2001, BSP3001, BSP3701, BSP4512, BSP4513, DAO2703, DOS3703, DOS3713, DSC2006, DSC3203, DSC3215, FIN2004, FIN2704, FIN2704X, FIN3101, FIN3102, FIN3103, FIN3113, FIN3114, FIN3115, FIN3116, FIN3117, FIN3701, FIN3702, FIN3703, FIN3711, FIN3712, FIN3713, FIN4718, MKT1003X, MKT2401, MKT2413, MKT3401, MKT3402, MKT3702, MKT3714, MNO1001, MNO1706, MNO1706X, MNO2007, MNO2009, MNO2302, MNO2312, MNO3301, MNO3303, MNO3313",
    "School site": "https://smith.queensu.ca/index.php",
    "School Review?": "yes"
  },
  {
    "School Code": "E0000000674",
    "Continent": "Canada",
    "School": "York University",
    "Semester details": "tbc",
    "NUS_Module_Code": "ACC1002X, ACC1701X, BSP2001, BSP3001, BSP3701, DAO2703, DBA3803, DSC2006, DSC3222, DSC4213, FIN2004, FIN2111, FIN2704, FIN2704X, FIN3101, FIN3102, FIN3115, FIN3116, FIN3117, FIN3120, FIN3701, FIN3702, FIN3711, FIN3712, FIN3713, FIN3717, FIN4112G, FIN4113, FIN4712, FIN4717, FIN4761A, MKT1003, MKT1705, MKT1705X, MKT2401, MKT2412, MKT2413, MKT3402, MKT3418, MKT3420, MKT3422X, MKT3422Y, MKT3422Z, MKT3702, MNO2007, MNO2302, MNO3301, MNO3303, MNO3313, MNO3313A, MNO3313X, MNO3313Y, MNO3313Z, MNO3314, MNO3320, MNO3330, MNO3761Y, MNO3761Z ",
    "School site": "https://schulich.yorku.ca/",
    "School Review?": "yes"
  },
  {
    "School Code": "E0000001734",
    "Continent": "Canada",
    "School": "HEC Montreal",
    "Semester details": "tbc",
    "NUS_Module_Code": "ACC2002, BSP2001, BSP2701, BSP3001, BSP3701, DAO2703, DOS3701, DSC2006, DSC3201, FIN2704, FIN3102, FIN3103, FIN3113, FIN3115, FIN3116, FIN3118, FIN3120, FIN3702, FIN3703, FIN3711, FIN3712, FIN3714, FIN3761X, FIN3761Y, FIN3761Z, MKT2401, MKT2412, MKT2413, MKT3402, MKT3420, MKT3422X, MKT3701, MKT3702, MNO2007, MNO2302, MNO3301, MNO3303, MNO3313, MNO3313X, MNO3313Y, MNO3313Z, MNO3314 ",
    "School site": "https://www.hec.ca/en/",
    "School Review?": "yes"
  },
  {
    "School Code": "E0000000572",
    "Continent": "Europe",
    "School": "Lund Univesity School of Economics and Management - Sweden",
    "Semester details": "tbc",
    "NUS_Module_Code": "ACC1002X, ACC1701X, BSP1004, BSP2001, BSP3001, BSP3701, DOS3701, DOS3702, DOS3713, DSC3201, DSC3202, DSC3213, DSC3214, DSC3222, DSC3222X, DSC3222Y, DSC3222Z, FIN2004, FIN2704, FIN2704X, FIN3101, FIN3102, FIN3113, FIN3119, FIN3120, FIN3120X, FIN3120Y, FIN3120Z, FIN3131, FIN3701, FIN3702, FIN3715, FIN4111, FIN4116, MKT2411, MKT2412, MKT2413, MKT3402, MKT3416, MKT3420, MKT3422X, MKT3422Y, MKT3422Z, MKT3424, MKT3702, MNO2007, MNO2009, MNO2302, MNO3301, MNO3303, MNO3313, MNO3313X, MNO3313Y, MNO3313Z, MNO3330, MNO3811 ",
    "School site": "https://www.lusem.lu.se/",
    "School Review?": "yes"
  }
]
